use productDB

CREATE TABLE producttype (
	producttypeid INT IDENTITY(1, 1) PRIMARY KEY NOT NULL, 
	producttypename VARCHAR(20) UNIQUE NOT NULL, 
)
INSERT INTO producttype VALUES
('蔬菜類'),
('瓜果類'),
('水果類'),
('生鮮肉類'),
('雜糧乾貨')

CREATE TABLE product (
	systemid INT NOT NULL IDENTITY(1, 1) PRIMARY KEY , 
	productid VARCHAR(14) NOT NULL, 
	producttype VARCHAR(20) NOT NULL, 
	productname NVARCHAR(100) NOT NULL, 
	productstock INT NOT NULL, 
	productcost NUMERIC(6, 1) NOT NULL, 
	productprice NUMERIC(6, 1) NOT NULL, 
	productimage VARCHAR(100) NOT NULL, 
	productdescription NVARCHAR(50) NOT NULL,
)

INSERT INTO product VALUES
('220419183501',	'蔬菜類', 	'高麗菜',		100,	80,		90,		'220419183501.jpg',	'當季盛產，香甜清脆'),
('220419183502',	'蔬菜類', 	'空心菜',		100,	90,		100,	'220419183502.jpg',	'富含膳食纖維及維生素Ｃ'),
('220419183503',	'蔬菜類', 	'青江菜',		100,	20,		28,		'220419183503.jpg',	'直接快炒就極美味'),
('220419183504',	'蔬菜類', 	'小白菜',		100,	25,		35,		'220419183504.jpg',	'一年四季都好吃的小白菜'),
('220419183505',	'蔬菜類',	'芹菜',			100,	30,		40,		'220419183505.jpg',	'味清香質甜脆'),
('220419183506',	'瓜果類',	'青椒',			100,	30,		40,		'220419183506.jpg',	'纖維高助消化'),
('220419183507',	'瓜果類',	'番茄', 		100,	40,		50,		'220419183507.jpg',	'營養價值高'),
('220419183508',	'瓜果類',	'小黃瓜',		100,	18,		28,		'220419183508.jpg',	'口感清脆'),
('220419183509',	'瓜果類',	'甜豆筴',		100,	30,		40,		'220419183509.jpg',	'料理前將頭尾的絲去除'),
('220419183510',	'瓜果類',	'玉米',			100,	70,		79,		'220419183510.jpg',	'膳食纖維含量高'),
('220419183511',	'水果類',	'蘋果',			100,	50,		60,		'220419183511.jpg',	'富士蘋果是從日本引進栽培種植'),
('220419183512',	'水果類',	'香蕉',			80,		70,		80,		'220419183512.jpg',	'肉質細緻，味甜而香'),
('220419183513',	'水果類',	'奇異果',		80,		49,		59,		'220419183513.jpg',	'紐西蘭產地直送'),
('220419183514',	'水果類',	'葡萄柚',		80,		45,		55,		'220419183514.jpg',	'酸甜滑順、可口多汁'),
('220419183515',	'水果類',	'芭樂',			80,		45,		55,		'220419183515.jpg',	'香脆鮮甜'),
('220419183516',	'生鮮肉類',	'臉頰肉',		80,		250,	280,	'220419183516.jpg',	'獨特的風味與口感'),
('220419183517',	'生鮮肉類',	'梅花肉',		80,		150,	180,	'220419183517.jpg',	'柔嫩多汁'),
('220419183518',	'生鮮肉類',	'大里肌肉排',	80,		100,	150,	'220419183518.jpg',	'肉質細緻Q彈'),
('220419183519',	'生鮮肉類',	'牛肋眼牛排',	80,		500,	590,	'220419183519.jpg',	'油花分佈均勻'),
('220419183520',	'生鮮肉類',	'沙朗牛排',		80,		1500,	1780,	'220419183520.jpg',	'精選來自澳洲和牛肉'),
('220419183521',	'生鮮肉類',	'和牛火鍋肉片',	80,		750,	799,	'220419183521.jpg',	'油花綿密'),
('220419183522',	'生鮮肉類',	'草飼沙朗牛排',	80,		200,	280,	'220419183522.jpg',	'肉香味濃郁'),
('220419183523',	'生鮮肉類',	'雞柳',			80,		120,	165,	'220419183523.jpg',	'保證安全'),
('220419183524',	'雜糧乾貨',	'寬麵',			200,	50,		85,		'220419183524.jpg',	'歷經12道繁複的滾輪壓實方法'),
('220419183525',	'雜糧乾貨',	'細麵',			200,	50,		85,		'220419183525.jpg',	'老師傅數十年經驗完美比例調小麥粉'),
('220419183526',	'雜糧乾貨',	'麵線',			200,	50,		85,		'220419183526.jpg',	'麵筋香Q有勁')



use productDB
select * from product ORDER BY productid
select * from ProductType ORDER BY producttypeid


use productDB
drop table product 
drop table ProductType 
